; domain
(define (domain satellite-typed)
(:requirements :equality :strips :typing)
(:types satellite
        direction
        instrument
        mode)
(:predicates
 (on_board ?i - instrument ?s - satellite)
 (supports ?i - instrument ?m - mode)
 (pointing ?s - satellite ?d - direction)
 (power_avail ?s - satellite)
 (power_on ?i - instrument)
 (calibrated ?i - instrument)
 (have_image ?d - direction ?m - mode)
 (calibration_target ?i - instrument ?d - direction))

(:action turn_to
 :parameters ( ?s - satellite ?d_new ?d_prev - direction)
 :precondition
 (and
      (pointing ?s ?d_prev)
      )
 :effect
 (and (pointing ?s ?d_new)
      (not (pointing ?s ?d_prev))))

(:action switch_on
 :parameters (?i - instrument ?s - satellite)
 :precondition
 (and (on_board ?i ?s)
      (power_avail ?s))
 :effect
 (and (power_on ?i)
      (not (calibrated ?i))
      (not (power_avail ?s))))

(:action switch_off
 :parameters (?i - instrument ?s - satellite)
 :precondition
	(and (on_board ?i ?s)
             (power_on ?i))
 :effect
	(and (power_avail ?s)
             (not (power_on ?i))))

(:action calibrate
 :parameters (?i - instrument ?s - satellite ?d - direction)
 :precondition
	(and (on_board ?i ?s)
             (calibration_target ?i ?d)
             (pointing ?s ?d)
             (power_on ?i))
 :effect
	 (calibrated ?i))

(:action take_image
 :parameters (?i - instrument ?s - satellite ?d - direction ?m - mode)
 :precondition
	(and (calibrated ?i)
             (on_board ?i ?s)
             (supports ?i ?m)
             (power_on ?i)
             (pointing ?s ?d))
 :effect
	 (have_image ?d ?m))

)

; problem
(DEFINE (PROBLEM SATELLITE-TYPED-3) (:DOMAIN SATELLITE-TYPED)
 (:OBJECTS PHENOMENON7 - DIRECTION PHENOMENON6 - DIRECTION PHENOMENON5 -
  DIRECTION STAR4 - DIRECTION STAR3 - DIRECTION STAR0 - DIRECTION STAR2 -
  DIRECTION STAR1 - DIRECTION SPECTROGRAPH2 - MODE INFRARED0 - MODE IMAGE1 -
  MODE INSTRUMENT3 - INSTRUMENT SATELLITE1 - SATELLITE INSTRUMENT2 - INSTRUMENT
  INSTRUMENT1 - INSTRUMENT INSTRUMENT0 - INSTRUMENT SATELLITE0 - SATELLITE)
 (:INIT (POINTING SATELLITE1 STAR0) (POWER_AVAIL SATELLITE1)
  (ON_BOARD INSTRUMENT3 SATELLITE1) (CALIBRATION_TARGET INSTRUMENT3 STAR0)
  (SUPPORTS INSTRUMENT3 IMAGE1) (SUPPORTS INSTRUMENT3 INFRARED0)
  (SUPPORTS INSTRUMENT3 SPECTROGRAPH2) (POINTING SATELLITE0 STAR4)
  (POWER_AVAIL SATELLITE0) (ON_BOARD INSTRUMENT2 SATELLITE0)
  (ON_BOARD INSTRUMENT1 SATELLITE0) (ON_BOARD INSTRUMENT0 SATELLITE0)
  (CALIBRATION_TARGET INSTRUMENT2 STAR0) (SUPPORTS INSTRUMENT2 IMAGE1)
  (SUPPORTS INSTRUMENT2 INFRARED0) (CALIBRATION_TARGET INSTRUMENT1 STAR2)
  (SUPPORTS INSTRUMENT1 IMAGE1) (CALIBRATION_TARGET INSTRUMENT0 STAR1)
  (SUPPORTS INSTRUMENT0 INFRARED0) (SUPPORTS INSTRUMENT0 SPECTROGRAPH2))
 (:GOAL
  (AND (POINTING SATELLITE0 PHENOMENON5) (HAVE_IMAGE STAR3 INFRARED0)
       (HAVE_IMAGE STAR4 SPECTROGRAPH2) (HAVE_IMAGE PHENOMENON5 SPECTROGRAPH2)
       (HAVE_IMAGE PHENOMENON7 SPECTROGRAPH2))))

; plan
1. (turn_to satellite0 phenomenon5 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon5)
   goals met: 1 of 5
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 5
3. (calibrate instrument3 satellite1 star0)
   added: (calibrated instrument3)
   goals met: 1 of 5
4. (turn_to satellite1 star4 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 star4)
   goals met: 1 of 5
5. (take_image instrument3 satellite1 star4 spectrograph2)
   added: (have_image star4 spectrograph2)
   goals met: 2 of 5
6. (turn_to satellite1 star3 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 star3)
   goals met: 2 of 5
7. (take_image instrument3 satellite1 star3 infrared0)
   added: (have_image star3 infrared0)
   goals met: 3 of 5
8. (turn_to satellite1 phenomenon7 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 phenomenon7)
   goals met: 3 of 5
9. (take_image instrument3 satellite1 phenomenon7 spectrograph2)
   added: (have_image phenomenon7 spectrograph2)
   goals met: 4 of 5
10. (turn_to satellite1 phenomenon5 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 phenomenon5)
   goals met: 4 of 5
11. (take_image instrument3 satellite1 phenomenon5 spectrograph2)
   added: (have_image phenomenon5 spectrograph2)
   goals met: 5 of 5
